plotMachineIOPS_LATENCY/fio_output/randread-16jobs-128files-4k.fio_ramdisk.out
jobs1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (128 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=796505: Wed Jul 26 01:49:48 2023
  read: IOPS=523k, BW=2044MiB/s (2143MB/s)(30.0GiB/15030msec)
    slat (nsec): min=847, max=31339, avg=1398.81, stdev=304.29
    clat (nsec): min=1268, max=2086.9k, avg=242918.32, stdev=42790.10
     lat (usec): min=2, max=2119, avg=244.35, stdev=43.05
    clat percentiles (usec):
     |  1.00th=[  223],  5.00th=[  229], 10.00th=[  229], 20.00th=[  231],
     | 30.00th=[  231], 40.00th=[  231], 50.00th=[  233], 60.00th=[  233],
     | 70.00th=[  233], 80.00th=[  235], 90.00th=[  237], 95.00th=[  396],
     | 99.00th=[  408], 99.50th=[  412], 99.90th=[  416], 99.95th=[  537],
     | 99.99th=[  717]
   bw (  MiB/s): min= 1219, max= 2215, per=100.00%, avg=2045.38, stdev=276.68, samples=30
   iops        : min=312080, max=567246, avg=523617.97, stdev=70829.53, samples=30
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=92.75%, 500=7.19%, 750=0.06%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=23.15%, sys=76.86%, ctx=11, majf=0, minf=174
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=7864320,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2044MiB/s (2143MB/s), 2044MiB/s-2044MiB/s (2143MB/s-2143MB/s), io=30.0GiB (32.2GB), run=15030-15030msec