plotMachineIOPS_LATENCY/fio_output/randread-16jobs-512files-4k.fio_fuse_ext4.out
jobs1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=1097060: Wed Jul 26 05:44:06 2023
  read: IOPS=7811, BW=30.5MiB/s (32.0MB/s)(3662MiB/120001msec)
    slat (usec): min=32, max=377, avg=123.32, stdev=65.87
    clat (usec): min=13, max=149338, avg=16250.64, stdev=3543.37
     lat (usec): min=259, max=149546, avg=16374.51, stdev=3564.71
    clat percentiles (usec):
     |  1.00th=[ 5080],  5.00th=[ 9503], 10.00th=[13435], 20.00th=[14746],
     | 30.00th=[15401], 40.00th=[15795], 50.00th=[16188], 60.00th=[16712],
     | 70.00th=[17433], 80.00th=[18482], 90.00th=[20317], 95.00th=[21365],
     | 99.00th=[22938], 99.50th=[23200], 99.90th=[23987], 99.95th=[32900],
     | 99.99th=[66847]
   bw (  KiB/s): min=17116, max=75879, per=100.00%, avg=31264.44, stdev=6529.37, samples=239
   iops        : min= 4279, max=18969, avg=7816.06, stdev=1632.33, samples=239
  lat (usec)   : 20=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=5.21%, 20=83.11%, 50=11.64%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=3.63%, sys=15.63%, ctx=937974, majf=0, minf=167
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=937390,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=30.5MiB/s (32.0MB/s), 30.5MiB/s-30.5MiB/s (32.0MB/s-32.0MB/s), io=3662MiB (3840MB), run=120001-120001msec