plotMachineIOPS_LATENCY/fio_output/randread-16jobs-64files-32k.fio_fuse_ext4.out
jobs1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=488817: Tue Jul 25 22:49:50 2023
  read: IOPS=4432, BW=139MiB/s (145MB/s)(16.2GiB/120001msec)
    slat (usec): min=78, max=431, avg=219.24, stdev=42.91
    clat (usec): min=13, max=77728, avg=28641.61, stdev=2232.86
     lat (usec): min=311, max=78073, avg=28861.60, stdev=2246.17
    clat percentiles (usec):
     |  1.00th=[16450],  5.00th=[26084], 10.00th=[26870], 20.00th=[27395],
     | 30.00th=[27919], 40.00th=[28181], 50.00th=[28705], 60.00th=[28967],
     | 70.00th=[29492], 80.00th=[30016], 90.00th=[31065], 95.00th=[31589],
     | 99.00th=[32637], 99.50th=[32900], 99.90th=[33817], 99.95th=[33817],
     | 99.99th=[37487]
   bw (  KiB/s): min=116658, max=271070, per=100.00%, avg=141847.20, stdev=10465.36, samples=239
   iops        : min= 3645, max= 8470, avg=4432.64, stdev=327.01, samples=239
  lat (usec)   : 20=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=1.22%, 50=98.76%
  lat (msec)   : 100=0.01%
  cpu          : usr=1.91%, sys=22.76%, ctx=532189, majf=0, minf=1071
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=531939,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=139MiB/s (145MB/s), 139MiB/s-139MiB/s (145MB/s-145MB/s), io=16.2GiB (17.4GB), run=120001-120001msec