plotMachineIOPS_LATENCY/fio_output/randread-1jobs-512files-32k.fio_tmpfs.out
jobs1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=1128353: Wed Jul 26 06:36:07 2023
  read: IOPS=136k, BW=4259MiB/s (4466MB/s)(30.0GiB/7213msec)
    slat (nsec): min=4606, max=73074, avg=6752.92, stdev=1428.04
    clat (nsec): min=1178, max=6816.7k, avg=931559.16, stdev=157918.31
     lat (usec): min=8, max=6884, avg=938.37, stdev=159.06
    clat percentiles (usec):
     |  1.00th=[  848],  5.00th=[  857], 10.00th=[  857], 20.00th=[  857],
     | 30.00th=[  865], 40.00th=[  865], 50.00th=[  865], 60.00th=[  873],
     | 70.00th=[  881], 80.00th=[  889], 90.00th=[ 1254], 95.00th=[ 1254],
     | 99.00th=[ 1270], 99.50th=[ 1287], 99.90th=[ 1909], 99.95th=[ 2040],
     | 99.99th=[ 4178]
   bw (  MiB/s): min= 3049, max= 4586, per=99.77%, avg=4249.28, stdev=611.76, samples=14
   iops        : min=97592, max=146774, avg=135977.00, stdev=19576.47, samples=14
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=83.80%
  lat (msec)   : 2=16.13%, 4=0.04%, 10=0.01%
  cpu          : usr=7.07%, sys=92.91%, ctx=13, majf=0, minf=1034
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=983040,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=4259MiB/s (4466MB/s), 4259MiB/s-4259MiB/s (4466MB/s-4466MB/s), io=30.0GiB (32.2GB), run=7213-7213msec