plotMachineIOPS_LATENCY/fio_output/randread-1jobs-64files-512k.fio_tmpfs.out
jobs1: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=526882: Wed Jul 26 00:22:15 2023
  read: IOPS=8952, BW=4476MiB/s (4694MB/s)(30.0GiB/6863msec)
    slat (usec): min=96, max=713, avg=110.65, stdev=22.43
    clat (nsec): min=1879, max=51327k, avg=14122776.13, stdev=2381922.97
     lat (usec): min=107, max=52042, avg=14233.56, stdev=2402.80
    clat percentiles (usec):
     |  1.00th=[13173],  5.00th=[13173], 10.00th=[13173], 20.00th=[13173],
     | 30.00th=[13173], 40.00th=[13173], 50.00th=[13173], 60.00th=[13173],
     | 70.00th=[13173], 80.00th=[13304], 90.00th=[19530], 95.00th=[19530],
     | 99.00th=[19792], 99.50th=[19792], 99.90th=[29754], 99.95th=[38011],
     | 99.99th=[47973]
   bw (  MiB/s): min= 2903, max= 4814, per=99.43%, avg=4450.54, stdev=697.41, samples=13
   iops        : min= 5806, max= 9628, avg=8901.08, stdev=1394.82, samples=13
  lat (usec)   : 2=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.03%, 10=0.09%, 20=99.65%, 50=0.19%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.92%, sys=99.02%, ctx=8, majf=0, minf=16396
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=61440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=4476MiB/s (4694MB/s), 4476MiB/s-4476MiB/s (4694MB/s-4694MB/s), io=30.0GiB (32.2GB), run=6863-6863msec